{
  "sprout-duration": "2022/7 - now",
  "sprout-position": "25Sprout - Front-end Developer intern",
  "sprout-summary": "During my internship, I have the experience of independently completing website maintenance, including electronic commerce, the brand's official website, and the point management system. The architecture of these websites varies, and the two main ones I use are React and JQuery. \nTake React as an example. In the project, Storybook is used to make UI components, and Redux and React Router are used to manage data and routing, and then packaged by Webpack. \nThe modification of each project uses Git for version control, and cooperates with colleagues on the GitLab platform.\nFollowing are the issues completed in each project.",
  "sprout-cameraEC": "Optimization of E-Commerce for Camera Brands.",
  "sprout-cameraEC-summary": "In this project, I am responsible for the optimization of product discounts. Modify the calculation logic of each discount item in the shopping process in response to customer requirements.",
  "sprout-cameraEC-list-1": "Connect API to obtain product information.",
  "sprout-cameraEC-list-2": "Use product information to determine the discount activities that each product can participate in, and use redux for state management and processing calculation logic.",
  "sprout-cameraEC-list-3": "Style management using classname",
  "sprout-camera": "Maintain Camera Brand Official Website",
  "sprout-camera-summary": "This project mainly completed the addition of content on the official website and the bug fix of image loading and used SFTP for file updates.",
  "sprout-car": "Optimize the Car Brand Point System",
  "sprout-car-summary": "In this project, I am responsible for optimizing the handling of error messages returned by the API. Cooperate with the backend developer during the process, and combine the returned results with i18next to present complete error messages to users and improve user experience.",
  "sprout-sky": "Maintain Web Pages for Airline E-Commerce",
  "sprout-sky-summary": "In this project, I am responsible for fixing the related problems that the client encounters in website layout, including UI rendering, user interaction improvement, and solving cross-device integration problems.",
  "sprout-sky-list-1": "Complete web page layout according to UI design.",
  "sprout-sky-list-2": "Create new features to optimize user experience.",
  "sprout-sky-list-3": "Integrate functions for various devices to ensure that web pages can work normally on various browsers on laptops and different types of mobile devices.",
  "sprout-sky-list-4": "Solve the vulnerability scanning problem and maintain the security of the website.",
  "college-duration": "2018/9 - 2022/6",
  "college-name": "Graduated from National Cheng Kung University\nMajor in Department of Geosciences / Double major in Department of Industrial and Information Management",
  "college-extra":"Experience of Campus Activity",
  "college-extra-singingClub": "Design Officer of the pop singing club",
  "college-extra-association": "Activities Officer of Erath Science Association"
}